ERP.belugaerp/src/Catalogs/СертификатыНоменклатуры/СертификатыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СертификатыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_УдалитьАдресФайлаСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВладелецСертификата</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/ОбластиДействияСертификатовНоменклатуры/ОбластиДействияСертификатовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОбластиДействияСертификатовНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>СертификатНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/СтатусыСертификатовНоменклатуры/СтатусыСертификатовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыСертификатовНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действующий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Недействующий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/СертификатыНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура бг_ЗаполнитьСертификатНоменклатурыПоУмолчанию(Товары) Экспорт
	
	СертификатыНоменклатуры = бг_СертификатыНоменклатурыКЗаполнениюПоУмолчанию(Товары);
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		Отбор = Новый Структура("Номенклатура", СтрокаТоваров.Номенклатура); 
		НайденныеСертификаты = СертификатыНоменклатуры.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(НайденныеСертификаты) Тогда
			СтрокаТоваров.бг_Сертификат = НайденныеСертификаты[0].СертификатНоменклатуры;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область СлужебныеПроцедурыИФункции

Функция бг_СертификатыНоменклатурыКЗаполнениюПоУмолчанию(Товары)
		
	НоменклатурыБезСертификатаТаблица = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
		Товары,
		Новый Структура("бг_Сертификат", Справочники.СертификатыНоменклатуры.ПустаяСсылка()),
		"Номенклатура");
	НоменклатурыБезСертификата = НоменклатурыБезСертификатаТаблица.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбластиДействияСертификатовНоменклатуры.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры) КАК СертификатНоменклатуры,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры) КАК КоличествоСертификатов
		|ИЗ
		|	РегистрСведений.ОбластиДействияСертификатовНоменклатуры КАК ОбластиДействияСертификатовНоменклатуры
		|ГДЕ
		|	ОбластиДействияСертификатовНоменклатуры.Номенклатура В(&НоменклатурыБезСертификата)
		|	И (ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Бессрочный
		|			ИЛИ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ДатаОкончанияСрокаДействия > &ТребуемаяДатаАктуальностиСертификата)
		|	И ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Действующий)
		|	И НЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбластиДействияСертификатовНоменклатуры.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры) = 1";	
	Запрос.УстановитьПараметр("НоменклатурыБезСертификата", НоменклатурыБезСертификата);
	Запрос.УстановитьПараметр("ТребуемаяДатаАктуальностиСертификата", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
